app/controllers/orders_controller.rb

  def index
    @orders = Order.paginate :page=> params[:page], :order => 'created_at desc',
      :per_page => 10
---
SELECT `orders`.* FROM `orders` ORDER BY created_at desc LIMIT 10 OFFSET 0

  def new
    @cart = current_cart
    if @cart.line_items.empty?
---
SELECT COUNT(*) FROM `line_items` WHERE (`line_items`.cart_id = 1)
SELECT `line_items`.* FROM `line_items` WHERE (`line_items`.cart_id = 1)

  def edit
    @order = Order.find(params[:id])
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1

  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
        session[:cart_id] = nil
        Notifier.order_received(@order).deliver
---
INSERT INTO `orders` (`name`, `address`, `email`, `pay_type`, `created_at`, `updated_at`) VALUES ('first order', 'sdf', 'cui.shujun@live.cn', 'Credit card', '2011-07-23 04:06:29', '2011-07-23 04:06:29')
DELETE FROM `carts` WHERE `carts`.`id` = 1
SELECT `line_items`.* FROM `line_items` WHERE (`line_items`.cart_id = 1)

  def update
    @order = Order.find(params[:id])

    respond_to do |format|
      if @order.update_attributes(params[:order])
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
UPDATE `orders` SET `email` = 'shujuncui@gmail.com', `updated_at` = '2011-07-23 04:29:36' WHERE `orders`.`id` = 1