app/controllers/users_controller.rb

  def index
    @users = User.order(:name)
---
SELECT `users`.* FROM `users` ORDER BY name